<div class="alert alert-block alert-danger"> 
    
NIM    :  
    
NAMA   :

KELAS  :

</div>

 # Data Preprocessing dengan Pandas

## <div class="alert alert-block alert-info">Pengenalan Library Pandas</div>

![Pandas Icon](img/pandas.png)
Pandas adalah alat analisis dan manipulasi data open source yang cepat, kuat, fleksibel dan mudah digunakan, dibangun di atas bahasa pemrograman Python. Secara khusus, Pandas menawarkan operasi struktur data dan operasi untuk memanipulasi tabel numerik serta deret waktu (*time-series*)

## <div class="alert alert-block alert-info"> Operasi Dasar Pandas pada Dataframe </div>

### <div class="alert alert-block alert-success"> Import library </div>

In [1]:
# import library
import pandas as pd

pd adalah alias yang umum digunakan untuk library pandas. Hal ini digunakan untuk memudahkan penggunaan library pandas

In [2]:
# read dataset
df = pd.read_csv('../dataset/occupation.csv')

In [3]:
df.head(5)

   user_id  age gender  occupation zip_code
0     1001   24      M  technician    85711
1     1002   53      F       other    94043
2     1003   23      M      writer    32067
3     1004   24      M  technician    43537
4     1005   33      F       other    15213

<div class="alert alert-block alert-warning">

*read_csv* merupakan function dari library pandas. Untuk melihat parameter yang bisa digunakan, Anda bisa melihatnya dengan cara menjalankan *pd.read_csv?*

*head* merupakan method dari objek df. Sama seperti function, untuk melihat dokumentasinya Anda bisa mengakses dengan cara menjalankan *df.head?*
</div>

Pada dataset df, terdapat 5 kolom/atribut, yaitu user_id, age, gender, occupation, zip_code. Untuk mencetak nama-nama kolom yang ada, Anda dapat menjalankan code *df.columns*.

Dataset df memiliki 943 objek/poin/instance. Untuk mengecek dimensi dataset, Anda dapat menjalankan code *df.shape*. Nilai pertama adalah jumlah baris/row dan nilai kedua adalah jumlah kolom/column/atribut.

In [4]:
df.columns

Index(['user_id', 'age', 'gender', 'occupation', 'zip_code'], dtype='object')

In [5]:
df.shape

(943, 5)

### <div class="alert alert-block alert-success"> Manipulasi dataset </div>

**Merubah nama kolom**

In [6]:
df.rename(columns={'occupation':'job'}, inplace=True)

In [7]:
df.head(3)

   user_id  age gender         job zip_code
0     1001   24      M  technician    85711
1     1002   53      F       other    94043
2     1003   23      M      writer    32067

**Slice dataset pada 1 kolom tertentu**

In [8]:
df['job']

0         technician
1              other
2             writer
3         technician
4              other
           ...
938          student
939    administrator
940          student
941        librarian
942          student
Name: job, Length: 943, dtype: object

**Slice dataset lebih dari 1 kolom tertentu**

In [9]:
df[['age','gender','job']]

     age gender            job
0     24      M     technician
1     53      F          other
2     23      M         writer
3     24      M     technician
4     33      F          other
..   ...    ...            ...
938   26      F        student
939   32      M  administrator
940   20      M        student
941   48      F      librarian
942   22      M        student

[943 rows x 3 columns]

**Akses hanya nilai dalam kolom**

In [10]:
umur = df['age'].values

**Slice instance tertentu dengan kondisi dari nilai kolom**

In [11]:
df[df['gender']=='F']

     user_id  age gender         job zip_code
1       1002   53      F       other    94043
4       1005   33      F       other    15213
10      1011   39      F       other    30329
11      1012   28      F       other    06405
14      1015   49      F    educator    97301
..       ...  ...    ...         ...      ...
924     1925   18      F    salesman    49036
929     1930   28      F   scientist    07310
937     1938   38      F  technician    55038
938     1939   26      F     student    33319
941     1942   48      F   librarian    78209

[273 rows x 5 columns]

In [12]:
# perlihatkan semua row yang gendernya laki-laki dengan umur lebih dari 30 tahun
df[(df['gender']=='M') & (df['age']>30)]

     user_id  age gender            job zip_code
5       1006   42      M      executive    98101
6       1007   57      M  administrator    91344
7       1008   36      M  administrator    05201
9       1010   53      M         lawyer    90703
12      1013   47      M       educator    29206
..       ...  ...    ...            ...      ...
931     1932   58      M       educator    06437
933     1934   61      M       engineer    22902
934     1935   42      M         doctor    66221
936     1937   48      M       educator    98072
939     1940   32      M  administrator    02215

[350 rows x 5 columns]

In [13]:
df[(df['gender']=='M') | (df['age']>30)]

     user_id  age gender            job zip_code
0       1001   24      M     technician    85711
1       1002   53      F          other    94043
2       1003   23      M         writer    32067
3       1004   24      M     technician    43537
4       1005   33      F          other    15213
..       ...  ...    ...            ...      ...
937     1938   38      F     technician    55038
939     1940   32      M  administrator    02215
940     1941   20      M        student    97229
941     1942   48      F      librarian    78209
942     1943   22      M        student    77841

[814 rows x 5 columns]

Menampilkan hanya nilai kolom job dengan kondisi pada 2 kolom, yaitu gender dan age

In [14]:
df[(df['gender']=='M') & (df['age']>=60)]['job'].values

array(['educator', 'retired', 'salesman', 'retired', 'retired', 'retired',
       'retired', 'educator', 'engineer', 'other', 'writer', 'educator',
       'retired', 'healthcare', 'executive', 'retired', 'retired',
       'librarian', 'retired', 'programmer', 'retired', 'engineer',
       'programmer', 'administrator', 'doctor', 'educator', 'retired',
       'educator', 'engineer'], dtype=object)

### <div class="alert alert-block alert-danger"> Soal Latihan </div>

1. Tampunglah semua list pekerjaan ke dalam variabel 'job'

2. Berapakah pelajar perempuan yang berusia 18 tahun atau lebih pada dataset tersebut?

## <div class="alert alert-block alert-info"> Data Preprocessing </div>

In [15]:
df = pd.read_csv('../dataset/occupation.csv')

In [16]:
df.head(3)

   user_id  age gender  occupation zip_code
0     1001   24      M  technician    85711
1     1002   53      F       other    94043
2     1003   23      M      writer    32067

### <div class="alert alert-block alert-success"> Tipe atribut </div>

    1. user_id     :  nominal
    2. age         :  ratio
    3. gender      :  nominal
    4. occuppation :  nominal
    5. zip_code    :  ordinal

### <div class="alert alert-block alert-success"> Deskripsi statistik </div>

In [17]:
df.describe()

           user_id         age
count   943.000000  943.000000
mean   1472.000000   34.051962
std     272.364951   12.192740
min    1001.000000    7.000000
25%    1236.500000   25.000000
50%    1472.000000   31.000000
75%    1707.500000   43.000000
max    1943.000000   73.000000

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 943 entries, 0 to 942
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   user_id     943 non-null    int64
 1   age         943 non-null    int64
 2   gender      942 non-null    object
 3   occupation  942 non-null    object
 4   zip_code    942 non-null    object
dtypes: int64(2), object(3)
memory usage: 37.0+ KB

### <div class="alert alert-block alert-success"> Pengecekan problem pada dataset </div>

**Missing Value**

In [19]:
df.isnull().sum()

user_id       0
age           0
gender        1
occupation    1
zip_code      1
dtype: int64

**Pengecekan instance yang memiliki missing value**

In [20]:
df[df.isnull().any(axis=1)]

    user_id  age gender     occupation zip_code
24     1025   39      M            NaN    55107
73     1074   39    NaN      scientist    T8H1N
79     1080   34      F  administrator      NaN

**Penanganan missing value dengan menghapus missing value**

In [21]:
df = df.dropna()

In [22]:
df

     user_id  age gender     occupation zip_code
0       1001   24      M     technician    85711
1       1002   53      F          other    94043
2       1003   23      M         writer    32067
3       1004   24      M     technician    43537
4       1005   33      F          other    15213
..       ...  ...    ...            ...      ...
938     1939   26      F        student    33319
939     1940   32      M  administrator    02215
940     1941   20      M        student    97229
941     1942   48      F      librarian    78209
942     1943   22      M        student    77841

[940 rows x 5 columns]

### <div class="alert alert-block alert-danger"> Soal Latihan </div>

1. Kenapa missing value perlu diidentifikasi dan ditangani?

................................................................................................

2. Selain dengan cara menghapuskan instance yang memiliki missing value, apakah cara penanganan lain yang dapat dilakukan untuk mengatasi permasalahan missing value? Jelaskan dan sebutkan !

................................................................................................

## <div class="alert alert-block alert-info"> Ekplorasi Data </div>

Untuk ekplorasi data, terlebih dahulu Anda harus merumuskan pertanyaan yang ingin dicari dalam dataset. Misalnya, *berapa jumlah pekerjaan yang ada?*, *berapa rata-rata umur wanita yang bekerja sebagai dokter?*, *apa saja pekerjaan yang tercatat* dan sebagainya.

Merumuskan pertanyan-pertanyaan tersebut adalah syarat awal dalam membuat visualisasi. Dari pertanyaan tersebut, muncul informasi yang ingin kita sampaikan melalui visualisasi nantinya.

### <div class="alert alert-block alert-success"> Mencari nilai unik dan jumlahnya </div>

In [23]:
df['occupation'].unique()

array(['technician', 'other', 'writer', 'executive', 'administrator',
       'student', 'lawyer', 'educator', 'scientist', 'entertainment',
       'programmer', 'librarian', 'homemaker', 'artist', 'engineer',
       'marketing', 'none', 'healthcare', 'retired', 'salesman', 'doctor'],
      dtype=object)

In [24]:
df['occupation'].value_counts()

student          196
other            105
educator          95
administrator     78
engineer          66
programmer        66
librarian         51
writer            45
executive         32
scientist         30
artist            28
technician        27
marketing         26
entertainment     18
healthcare        16
retired           14
lawyer            12
salesman          12
none               9
homemaker          7
doctor             7
Name: occupation, dtype: int64

### <div class="alert alert-block alert-success"> Summarization </div>

Summarization atau ringkasan dari data bertujuan untuk mencari gambaran besar dari dataset.

Dalam Pandas, terdapat dua method yang dapat digunakan berkaitan dengan summarization. Aggregate berfungsi untuk melihat ringkasan data secara keseluruhan. Sedangkan *groupby()* berfungsi untuk melihat ringkasan dari subset data.

<div class="alert alert-block alert-warning">
    Method Aggregation Pandas
</div>

|Method|Deskripsi|
|:-|:-|
|*count()*|Total item|
|*min()*, *max()*|Nilai paling kecil dan paling besar|
|*first()*, *last()*|Nilai awal dan akhir|
|*mean()*, *median()*|Rerata dan nilai tengah|
|*std()*, *var()*|Standar deviasi dan variance|
|*prod()*|Dot product|
|*sum()*|Jumlah/sum dari item|

<div class="alert alert-block alert-warning">
</div>

In [25]:
df.max()

user_id         1943
age               73
gender             M
occupation    writer
zip_code       Y1A6B
dtype: object

In [26]:
df.min()

user_id                1001
age                       7
gender                    F
occupation    administrator
zip_code              00000
dtype: object

In [27]:
df.count()

user_id       940
age           940
gender        940
occupation    940
zip_code      940
dtype: int64

In [28]:
df['age'].mean()

34.041489361702126

### <div class="alert alert-block alert-success"> Mencari informasi dalam sub-dataset </div>

Berikut merupakan contoh dari penggunaan method *groupby()*.

In [29]:
df.groupby('occupation').count()

               user_id  age  gender  zip_code
occupation
administrator       78   78      78        78
artist              28   28      28        28
doctor               7    7       7         7
educator            95   95      95        95
engineer            66   66      66        66
entertainment       18   18      18        18
executive           32   32      32        32
healthcare          16   16      16        16
homemaker            7    7       7         7
lawyer              12   12      12        12
librarian           51   51      51        51
marketing           26   26      26        26
none                 9    9       9         9
other              105  105     105       105
programmer          66   66      66        66
retired             14   14      14        14
salesman            12   12      12        12
scientist           30   30      30        30
student            196  196     196       196
technician          27   27      27        27
writer              45   45      45        45

In [30]:
df.groupby('occupation', as_index=False).count()

       occupation  user_id  age  gender  zip_code
0   administrator       78   78      78        78
1          artist       28   28      28        28
2          doctor        7    7       7         7
3        educator       95   95      95        95
4        engineer       66   66      66        66
5   entertainment       18   18      18        18
6       executive       32   32      32        32
7      healthcare       16   16      16        16
8       homemaker        7    7       7         7
9          lawyer       12   12      12        12
10      librarian       51   51      51        51
11      marketing       26   26      26        26
12           none        9    9       9         9
13          other      105  105     105       105
14     programmer       66   66      66        66
15        retired       14   14      14        14
16       salesman       12   12      12        12
17      scientist       30   30      30        30
18        student      196  196     196       196
19     technician       27   27      27        27
20         writer       45   45      45        45

Untuk melihat ringkasan dari subset data kita dapat menambahkan method aggregate di belakang method *groupby()*

In [31]:
df.groupby('occupation', as_index=False).age.median()

       occupation   age
0   administrator  37.5
1          artist  30.0
2          doctor  45.0
3        educator  42.0
4        engineer  35.5
5   entertainment  25.0
6       executive  38.5
7      healthcare  44.5
8       homemaker  32.0
9          lawyer  34.0
10      librarian  39.0
11      marketing  36.0
12           none  26.0
13          other  32.0
14     programmer  30.0
15        retired  63.0
16       salesman  34.0
17      scientist  36.5
18        student  21.0
19     technician  30.0
20         writer  36.0

In [32]:
# berapa rerata umur setiap pekerjaan/occupation berdasarkan gender
df.groupby(['occupation', 'gender']).age.mean()

occupation     gender
administrator  F         40.828571
               M         37.162791
artist         F         30.307692
               M         32.333333
doctor         M         43.571429
educator       F         39.115385
               M         43.101449
engineer       F         29.500000
               M         36.562500
entertainment  F         31.000000
               M         29.000000
executive      F         44.000000
               M         38.172414
healthcare     F         39.818182
               M         45.400000
homemaker      F         34.166667
               M         23.000000
lawyer         F         39.500000
               M         36.200000
librarian      F         40.000000
               M         40.000000
marketing      F         37.200000
               M         37.875000
none           F         36.500000
               M         18.600000
other          F         35.472222
               M         34.028986
programmer     F         32.166667
               M         33.216667
retired        F         70.000000
               M         62.538462
salesman       F         27.000000
               M         38.555556
scientist      F         28.333333
               M         36.222222
student        F         20.750000
               M         22.669118
technician     F         38.000000
               M         32.961538
writer         F         37.631579
               M         35.346154
Name: age, dtype: float64

In [33]:
df.groupby(['occupation', 'gender']).age.agg(['min','max'])

                      min  max
occupation    gender
administrator F        22   62
              M        21   70
artist        F        19   48
              M        20   45
doctor        M        28   64
educator      F        23   51
              M        25   63
engineer      F        23   36
              M        22   70
entertainment F        24   38
              M        15   50
executive     F        39   49
              M        22   69
healthcare    F        22   53
              M        28   62
homemaker     F        20   50
              M        23   23
lawyer        F        28   51
              M        21   53
librarian     F        26   59
              M        23   69
marketing     F        24   50
              M        24   55
none          F        26   55
              M        11   33
other         F        18   55
              M        13   64
programmer    F        26   38
              M        20   63
retired       F        70   70
              M        51   73
salesman      F        18   33
              M        21   66
scientist     F        26   31
              M        23   55
student       F        13   38
              M         7   42
technician    F        38   38
              M        21   55
writer        F        18   56
              M        21   60

### <div class="alert alert-block alert-danger"> Soal Latihan </div>

1. Pekerjaan apa yang paling banyak dijalani oleh perempuan?

In [34]:
#code

Tulis jawaban

2. Pekerjaan apa yang memiliki pekerja perempuan dan pria termuda?

In [35]:
#code

Tulis jawaban di sini

3. Berapa perbandingan guru wanita dan guru pria?

In [36]:
#code

Tulis jawaban di sini

##  <center><div class="alert alert-block alert-danger"> TUGAS </div>

### <div class="alert alert-block alert-danger"> Read Dataset </div>

Baca dataset titanic, kemudian tampung di variabel **dt**

Tampilkan 10 instance paling pertama dalam dataset tersebut

Berapakah jumlah instance dalam dataset tersebut ?

Pada dataset titanic terdapat data penumpang yang menaiki kapal Titanic pada tahun 1912. Dataset tersebut memiliki delapan atribut, yaitu :

1. Survive = penanda masih hidupnya penumpang setelah kecelakaan. 1 masih hidup, 0 meninggal
2. Pclass = passenger class atau kelas penumpang. 1 kelas bisnis, 2 kelas eksekutif, 3 kelas ekonomi
3. Name = nama dari penumpang
4. Sex = jenis kelamin dari penumpang
5. Siblings/Spouses Aboard = jumlah saudara atau pasangan dari penumpang yang ikut dalam Titanic
6. Parents/Children Aboard = jumlah orangtua atau anak dari penumpang yang ikut dalam Titanic
7. Fare = biaya yang dikeluarkan penumpang dalam nilai USD, (.) titik berarti desimal

Ubah nama kolom menjadi sebagai berikut :

1. Survive = survive
2. Pclass = class
3. Name = name
4. Sex = sex
5. Siblings/Spouses Aboard = siblings-spouses
6. Parents/Children Aboard = parents-childs
7. Fare = fare
8. Age = age

Tentukan tipe masing-masing atribut

### <div class="alert alert-block alert-danger"> Preprocessing </div>

Tentukan apakah ada missing value

Tampilkan instance yang memiliki missing value

Tangani missing value tersebut dengan menghapus instance yang memiliki missing value

Buktikan bahwa tidak ada lagi missing value pada dataset

Tampilkan hanya atribut nama dan umur penumpang

Tampung semua nama penumpang pada kelas Bisnis yang memiliki umur lebih dari 50 tahun ke dalam variabel name_B_50plus

### <div class="alert alert-block alert-danger"> Data Eksplorasi </div>

1. Berapakah jumlah penumpang Bisnis?

In [37]:
# code di sini

penjelasan di sini

2. Berapakah jumlah penumpang wanita kelas Ekonomi?

In [38]:
# code di sini

penjelasan di sini

3. Berapakah harga tiket paling mahal yang harus dikeluarkan penumpang kelas Ekonomi?

In [39]:
# code di sini

penjelasan di sini

4. Berapakah jumlah penumpang pria pada kelas Ekonomi?

In [40]:
# code di sini

penjelasan di sini

5. Kelas manakah yang memiliki paling banyak penumpang yang single (tidak mengajak pasangan)?

In [41]:
# code di sini

penjelasan di sini

6. Pada kelas Bisnis, gender manakah yang paling banyak single (tidak mengajak pasangan)?

In [42]:
# code di sini

penjelasan di sini